clc;clear;format long g
%==========================================================================
%示例程序：
%1）J2000地心惯性坐标系与固定地球坐标系的转换关系
%2）J2000地心惯性坐标系余静止轨道卫星轨道坐标系的转换关系
%3）GEO卫星波束波束指向

d2r = pi/180;

%% GEO卫星定点经度[deg]以及轨道半径[km]%%
Long = [0:20:340]';
r_gso = 42164.2;
%% GEO卫星波束指向 方位角[deg] 俯仰角[deg]
Az = [270 85 180 260  260  0   265  90 110  90  270 290 290  270   0  90 90 320]';
El = [83  85 88  86   85.7 90  83.8 89 85   87  82  83  84  86.5   90 87 88 87.5]';

%% 格林尼治恒星时角的变化率
we = 360/(86400*0.99727); %%[deg/sec]

%%任务时刻与初始时刻的时间差[sec]
dt = 86400;

%%初始时刻（修正儒略日MJD=58849）的格林尼治恒星时角[deg]
thita_g0 = 100.1218;

%%dt时刻（修正儒略日MJD=58849）的格林尼治恒星时角[deg]
thita_g = thita_g0 + we*dt;
thita_g = mod(thita_g,360);


%%%%dt时刻,固定地球坐标系到J2000地心惯性坐标系的转换矩阵
R_ie = Rz(-thita_g*d2r);

%以GEO卫星2为例给出GEO卫星在固定地球坐标系的位置和GEO卫星的波束在GEO卫星的轨道坐标系的指向
k=2;
long = Long(k)*d2r;
az = Az(k)*d2r;
el = El(k)*d2r;
%%GEO卫星在固定地球坐标系的位置
R_geo_e = r_gso*[cos(long) sin(long) 0]';
%%GEO卫星的波束在GEO卫星的轨道坐标系的指向
poi_o = [cos(el)*cos(az) cos(el)*sin(az) sin(el)]';


%%dt时刻,静止轨道卫星轨道坐标系到J2000地心惯性坐标系的坐标转换矩阵
R_io = Rz(-thita_g*d2r-long)*Rz(-pi/2)*Rx(pi/2);
%%dt时刻,GEO卫星的波束在J2000地心惯性坐标系的指向
poi_i = R_io*poi_o;
%%dt时刻,GEO卫星在J2000地心惯性坐标系的位置
R_geo_i = R_ie*R_geo_e;